{
  "basics": {
    "name": "Vidya Sagar",
    "label": "Software Developer",
    "picture": "https://github.com/vidya-hub.png",
    "email": "mavuduru.123.sagar@gmail.com",
    "phone": "+91 9676231598",
    "website": "https://vidya-hub.github.io/",
    "summary": "Experienced tech professional specialized in Flutter,ReactJs,NodeJs,Python,and Cloud Computing. Passionate about creating seamless user experiences using cutting-edge technologies.",
    "location": {
      "address": "",
      "postalCode": "______",
      "city": "Srikakulam",
      "countryCode": "India",
      "region": "Andhra Pradesh"
    },
    "profiles": [
      {
        "network": "github",
        "username": "vidya-hub",
        "url": "http://github.com/vidya-hub"
      },
      {
        "network": "linkedin",
        "username": "Vidya Sagar",
        "url": "https://www.linkedin.com/in/vidya-sagar-129b17130/"
      }
    ]
  },
  "interests": [
    { "name": "Artificial Intelligence" },
    { "name": "Image Processing" },
    { "name": "Computer Vision" },
    { "name": "Robotics" },
    { "name": "3D Graphics" }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": ["Dart", "JavaScript", "Python", "Java"]
    },
    {
      "name": "Toolsets/OS",
      "keywords": ["MacOS", "Linux", "Git/GitHub"]
    }
  ],
  "education": [
    {
      "institution": "Sri Sivani College Of Engineering,Srikakulam",
      "area": "Electrical and Electronics Engineering",
      "studyType": "B.tech",
      "startDate": "May 2017",
      "endDate": "May 2020",
      "courses": []
    }
  ],
  "work": [
    {
      "company": "Onpassive Technologies",
      "position": "Flutter Developer",
      "website": "",
      "startDate": "2023-05-01",
      "endDate": "Present",
      "summary": "Contributed to OES, OMail, and O-Connect mobile apps, providing efficient and innovative solutions. Improved video calls with enhanced virtual backgrounds and 3D avatars using React and three.js. Utilized state management techniques like BLOC, RiverPod, and Provider for seamless app performance. Streamlined transactions by integrating various payment gateways for end-users. Enhanced real-time communication in Flutter apps with WebSockets and WebRTC. Added advanced functionality to Flutter using JavaScript packages like summernote.js and fabric.js.",
      "highlights": [
        "Improved video calls with enhanced virtual backgrounds and 3D avatars using React and three.js",
        "Utilized state management techniques like BLOC, RiverPod, and Provider for seamless app performance",
        "Streamlined transactions by integrating various payment gateways for end-users",
        "Enhanced real-time communication in Flutter apps with WebSockets and WebRTC",
        "Added advanced functionality to Flutter using JavaScript packages like summernote.js and fabric.js"
      ]
    },
    {
      "company": "ONO (Agritech Product Company)",
      "position": "Software Engineer",
      "website": "",
      "startDate": "2022-04-01",
      "endDate": "2023-04-01",
      "summary": "Developed ONO CLICK mobile app for farmers and mandi agents using Flutter and Kotlin, providing essential features tailored to their needs. Built custom PDF generation backend with Node.js, Puppeteer, Docker, and AWS, streamlining document creation and delivery.",
      "highlights": [
        "Developed ONO CLICK mobile app for farmers and mandi agents using Flutter and Kotlin",
        "Built custom PDF generation backend with Node.js, Puppeteer, Docker, and AWS"
      ]
    },
    {
      "company": "Bugs & Errors Studio",
      "position": "Flutter Developer",
      "website": "",
      "startDate": "2022-04-01",
      "endDate": "2023-04-01",
      "summary": "Built Wander With Food app using Flutter and Firebase, enhancing user experience with location and notification services via GraphQL and REST APIs. Developed SparePay mobile payment app with Flutter and PayU, incorporating biometric authentication for secure transactions and user protection.",
      "highlights": [
        "Built Wander With Food app using Flutter and Firebase",
        "Enhanced user experience with location and notification services via GraphQL and REST APIs",
        "Developed SparePay mobile payment app with Flutter and PayU, incorporating biometric authentication for secure transactions and user protection"
      ]
    }
  ]
}
